In [1]:
### Hypothesis Testing Case Study

import numpy as np
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

import scipy.stats as stats

cust = pd.read_csv('C:\\Users\\Yash\\Desktop\\STATS\\CASE STUDY FOR PANDAS\\8. Basic Stats - Case Study-2\\Testing_Of_Hypothesis.csv')

cust.columns

Index(['Sr No', 'S_Cust_id', 'Samsung Score', 'Apple_Cust_id', 'Apple_Score'], dtype='object')

In [2]:
cust.head()

   Sr No S_Cust_id  Samsung Score Apple_Cust_id  Apple_Score
0      1   S336499             94       A336525           82
1      2    S73004             99        A73011           83
2      3    S79537             74        A79538           88
3      4   S769168             74       A769222           80
4      5   S609791             83       A609801           74

In [3]:
df_new = cust.rename(columns={'Samsung Score': 'Samsung_Score'})
df_new.head()

   Sr No S_Cust_id  Samsung_Score Apple_Cust_id  Apple_Score
0      1   S336499             94       A336525           82
1      2    S73004             99        A73011           83
2      3    S79537             74        A79538           88
3      4   S769168             74       A769222           80
4      5   S609791             83       A609801           74

# One Sample T-Test

In [4]:
stats.ttest_1samp(a = df_new.Samsung_Score, popmean = 50)  # Pop mean

Ttest_1sampResult(statistic=29.465073943150735, pvalue=8.454355371190854e-51)

In [5]:
df_new.Samsung_Score.mean()

84.9

In [6]:
#Ho taking Samsung Average Customer Satisfaction Score 75% 
#Ha taking Samsung Average Customer Satisfaction Score not 75%

cal = 0.75 * 84.9
cal

63.675000000000004

In [7]:
ttest= stats.ttest_1samp(a=cust['Samsung Score'], popmean =cal )
t_score = round(ttest.statistic,2)
p_value = ttest.pvalue

In [8]:
p_value

7.714674273163621e-33

In [9]:
t_score

17.92

In [10]:
#conculsion
#Significance value of the test < 0.05,reject the null hypothesis as Samsung Average Customer Satisfaction Score!=75%.
#Hence the hypothesis The Samsung Average customer satisfaction score is minimum 75% is wrong

# Q2

# Two Sample T-Test (Paired)

In [11]:
print (df_new.Samsung_Score.mean())

84.9

In [12]:
Apple_Score = cust['Apple_Score']
Apple_Score.mean()

87.81

In [13]:
# stats.ttest_rel(a = before, b = after)
stats.ttest_rel(a = df_new.Samsung_Score, b = df_new.Apple_Score)

Ttest_relResult(statistic=-1.9015800946572132, pvalue=0.06013359092250469)

In [14]:
 # equal variance
equal_var = stats.ttest_ind(a= df_new.Samsung_Score,b= Apple_Score,equal_var=True)   
equal_var.statistic

-1.9064295935043472

In [15]:
  # UnEqual variance
UnEqual_var = stats.ttest_ind(a= df_new.Samsung_Score,b= Apple_Score,equal_var=False)  
UnEqual_var.statistic

-1.9064295935043474

In [16]:
UnEqual_var.statistic - equal_var.statistic

-2.220446049250313e-16

In [17]:
t_val = equal_var.statistic

p_val  = equal_var.pvalue

print("t-score is {} \np-value is {}".format(t_val ,p_val ))

if(p_val <0.05):#0.05 limit
    print('Reject null hypothesis')
else:
    print('Accept null hypothesis')

t-score is -1.9064295935043472
p-value is 0.05804261444411807
Accept null hypothesis

In [18]:
# satisfaction score of Samsung is same as Apple
# no difference in the satisfaction scores